tdxguiping/ESP32_S3_epaper/main/factory_reset/factory_reset.c
    snprintf(bin_dir, sizeof(bin_dir), "%s/bin_img", base_path);
    snprintf(jpg_dir, sizeof(jpg_dir), "%s/jpg_img", base_path);
    snprintf(cast_dir, sizeof(cast_dir), "%s/cast_img", base_path);

    if (stat(base_path, &st) != 0) {
        ESP_LOGW(TAG, "factory reset skipped storage not ready base=%s", base_path);
        return ESP_ERR_NOT_FOUND;
    }

    /*
     * English: Stop slideshow before deleting image files so the slideshow task
     * does not try to preload a file that is being removed. EPD display itself is
     * not interrupted; cleanup only proceeds when the display queue is idle.
     */
    ServerNetworkStaSlideshow_Stop();

    /*
     * Reserve the idle EPD for the complete cleanup transaction. This closes
     * the check-then-act window where a PB2 event could otherwise start local
     * browsing immediately after a standalone busy check.
    */
    epd_display_reservation_t reset_reservation = {0};
#if USER_EPD_ENABLE
    esp_err_t reserve_ret =
        ServerNetworkStaEpdDisplay_TryReserveIdle(&reset_reservation);
    if (reserve_ret != ESP_OK) {
        ESP_LOGW(TAG, "factory reset aborted because EPD became BUSY");
        return ESP_ERR_INVALID_STATE;
    }
#endif

    esp_err_t lock_ret = TdxSharedSpi_Lock(portMAX_DELAY);
    if (lock_ret != ESP_OK) {
        ServerNetworkStaEpdDisplay_ReleaseReservation(&reset_reservation);
        return lock_ret;
    }

    /*
     * English: Factory-default image cleanup deletes saved image payloads from
     * both upload/slideshow storage and cast/cast2pic cache. It intentionally
     * keeps device identity, EPD type, work timers, CH583 data, and OTA state.
     * Saved WiFi credentials are cleared after releasing the shared SPI lock.
     */
    result->upload_bin_deleted =
        factory_reset_delete_files_with_ext(bin_dir, ".bin", result);
    result->upload_jpg_deleted =
        factory_reset_delete_files_with_ext(jpg_dir, ".jpg", result);
    result->cast_bin_deleted =
        factory_reset_delete_files_with_ext(cast_dir, ".bin", result);
    result->cast_jpg_deleted =
        factory_reset_delete_files_with_ext(cast_dir, ".jpg", result);

    TdxSharedSpi_Unlock();

    factory_reset_clear_persistent_state(result);
    esp_err_t cleanup_ret =
        result->file_ret != ESP_OK ? result->file_ret : result->nvs_ret;
    if (cleanup_ret == ESP_OK) {
        result->welcome_pending_ret = factory_reset_save_welcome_pending();
        if (result->welcome_pending_ret == ESP_OK) {
            result->white_display_ret =
                ServerNetworkStaEpdDisplay_QueueReservedSolidColorAndWait(
                    &reset_reservation,
                    WHITE,
                    1);
            if (result->white_display_ret == ESP_OK) {
                ESP_LOGI(TAG, "factory reset white display completed color=0x%02x",
                         WHITE);
            } else {
                ESP_LOGE(TAG, "factory reset white display failed ret=%s",
                         esp_err_to_name(result->white_display_ret));
            }
        }
    }
    ServerNetworkStaEpdDisplay_ReleaseReservation(&reset_reservation);
    return cleanup_ret != ESP_OK ? cleanup_ret :
           result->welcome_pending_ret != ESP_OK ? result->welcome_pending_ret :
                                                   result->white_display_ret;
}

esp_err_t FactoryReset_HandleStartupWelcome(const char *base_path,
                                            bool sd_ready)
{
    if (base_path == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    uint8_t pending = 0;
    esp_err_t ret = app_nvs_read_u8(FACTORY_RESET_WELCOME_PENDING_NVS_KEY,
                                    &pending,
                                    0);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "factory reset startup welcome flag read failed ret=%s",
                 esp_err_to_name(ret));
        return ret;
    }
    if (pending == 0) {
        return ESP_OK;
    }
    if (pending != FACTORY_RESET_WELCOME_PENDING_VALUE) {
        ESP_LOGE(TAG, "factory reset startup welcome flag invalid value=%u",
                 (unsigned int)pending);
        return ESP_ERR_INVALID_STATE;
    }

    __atomic_store_n(&s_factory_reset_startup_welcome_busy,
                     true,
                     __ATOMIC_RELEASE);
    ESP_LOGW(TAG, "factory reset startup welcome begin");
    ServerNetworkStaWifiWorkTime_SetFactoryResetGuard(true);
    UserLedStatus_FactoryResetBegin();

    factory_reset_welcome_file_t welcome_file = {0};
    epd_display_reservation_t reservation = {0};
    bool display_succeeded = false;

    ret = ServerNetworkStaEpdDisplay_TryReserveIdle(&reservation);
    if (ret == ESP_OK) {
        ret = sd_ready
                  ? FactoryResetWelcome_Load(base_path, &welcome_file)
                  : ESP_ERR_INVALID_STATE;
    }
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "factory reset startup welcome loaded file=%s size=%u",
                 welcome_file.file_name,
                 (unsigned int)welcome_file.size);
        ret = factory_reset_display_welcome(&reservation,
                                            welcome_file.data,
                                            welcome_file.size);
        if (ret == ESP_OK) {
            display_succeeded = true;
            ESP_LOGI(TAG, "factory reset startup welcome displayed from SD");
        }
    }
    ServerNetworkStaEpdDisplay_ReleaseReservation(&reservation);
    FactoryResetWelcome_Release(&welcome_file);

    if (!display_succeeded) {
        // The reserved SD welcome path is fully released before the raw test job.
        ESP_LOGW(TAG,
                 "factory reset startup welcome unavailable, using color bars sd_ready=%d ret=%s",
                 sd_ready ? 1 : 0,
                 esp_err_to_name(ret));
        ret = test_epd_display_and_wait();
        if (ret == ESP_OK) {
            display_succeeded = true;
            ESP_LOGI(TAG, "factory reset startup welcome color bars displayed");
        } else {
            ESP_LOGE(TAG,
                     "factory reset startup welcome color bars failed ret=%s",
                     esp_err_to_name(ret));
        }
    }

    if (display_succeeded) {
        ret = app_nvs_erase_key(FACTORY_RESET_WELCOME_PENDING_NVS_KEY);
        if (ret == ESP_OK) {
            ESP_LOGI(TAG,
                     "factory reset startup welcome completed, pending flag cleared");
        } else {
            ESP_LOGE(TAG,
                     "factory reset startup welcome flag clear failed ret=%s",
                     esp_err_to_name(ret));
        }
    }

