tdxguiping/ESP32_S3_epaper/main/factory_reset/factory_reset.c
    (void)ServerNetworkStaWifiWorkTime_StartWifiConnectGuardIfInactive(
        WIFI_CONNECT_POWER_GUARD_MAX_MS);
    ServerNetworkStaWifiWorkTime_SetFactoryResetGuard(false);
    UserLedStatus_FactoryResetEnd();
    __atomic_store_n(&s_factory_reset_startup_welcome_busy,
                     false,
                     __ATOMIC_RELEASE);
    return ret;
}

static bool factory_reset_button_is_active(void)
{
    return gpio_get_level(TDX_FACTORY_RESET_GPIO) == TDX_FACTORY_RESET_ACTIVE_LEVEL;
}

static esp_err_t factory_reset_run(const factory_reset_context_t *ctx,
                                   factory_reset_trigger_t trigger,
                                   uint16_t protocol_seq)
{
    ESP_LOGW(TAG,
             "factory reset start source=%s seq=%u",
             factory_reset_trigger_to_string(trigger),
             (unsigned int)protocol_seq);

    ServerNetworkStaWifiWorkTime_SetFactoryResetGuard(true);
    UserLedStatus_FactoryResetBegin();
    factory_reset_result_t result = {
        .file_ret = ESP_OK,
        .nvs_ret = ESP_OK,
    };
    esp_err_t ret = factory_reset_execute(ctx->base_path, &result);
    ESP_LOGW(TAG,
             "factory reset done source=%s seq=%u ret=%s upload_bin_deleted=%d upload_jpg_deleted=%d cast_bin_deleted=%d cast_jpg_deleted=%d cfg_deleted=%d file_delete_failed=%d file_ret=%s nvs_ret=%s welcome_pending_ret=%s white_display_ret=%s",
             factory_reset_trigger_to_string(trigger),
             (unsigned int)protocol_seq,
             esp_err_to_name(ret),
             result.upload_bin_deleted,
             result.upload_jpg_deleted,
             result.cast_bin_deleted,
             result.cast_jpg_deleted,
             result.config_deleted,
             result.file_delete_failed,
             esp_err_to_name(result.file_ret),
             esp_err_to_name(result.nvs_ret),
             esp_err_to_name(result.welcome_pending_ret),
             esp_err_to_name(result.white_display_ret));

    if (ret == ESP_OK) {
        int provision_ret = ch583_wifi_uart_send_wifi_provision_status(0);
        if (provision_ret < 0) {
            ESP_LOGE(TAG,
                     "factory reset WIFI_PROVISION unconfigured send failed ret=%d",
                     provision_ret);
        }
    }
    if (ret == ESP_OK) {
        factory_reset_finish_request(true);
        ServerNetworkStaWifiWorkTime_SetFactoryResetGuard(false);
    } else {
        /* Clear the old guard before reopening IDLE so a new request cannot
         * have its freshly-set guard cleared by this failed transaction. */
        ServerNetworkStaWifiWorkTime_SetFactoryResetGuard(false);
        factory_reset_finish_request(false);
    }
    UserLedStatus_FactoryResetEnd();
    return ret;
}

static esp_err_t factory_reset_worker_run(const void *payload,
                                          size_t payload_size)
{
    if (payload == NULL ||
        payload_size != sizeof(factory_reset_worker_request_t)) {
        ServerNetworkStaWifiWorkTime_SetFactoryResetGuard(false);
        factory_reset_finish_request(false);
        return ESP_ERR_INVALID_ARG;
    }

    factory_reset_worker_request_t request = {0};
    memcpy(&request, payload, sizeof(request));
    return factory_reset_run(&s_factory_reset_ctx,
                             request.trigger,
                             request.protocol_seq);
}

static esp_err_t factory_reset_submit_claimed(factory_reset_trigger_t trigger,
                                              uint16_t protocol_seq)
{
    Ch583FactoryTest_CancelForFactoryReset();
    factory_reset_worker_request_t request = {
        .trigger = trigger,
        .protocol_seq = protocol_seq,
    };
    uint32_t generation =
        __atomic_add_fetch(&s_factory_reset_generation, 1U, __ATOMIC_ACQ_REL);
    uint32_t replace_mask =
        IMAGE_BUSINESS_OWNER_MASK(IMAGE_BUSINESS_OWNER_DAILY) |
        IMAGE_BUSINESS_OWNER_MASK(IMAGE_BUSINESS_OWNER_SLIDESHOW) |
        IMAGE_BUSINESS_OWNER_MASK(IMAGE_BUSINESS_OWNER_LOCAL_IMAGE) |
        IMAGE_BUSINESS_OWNER_MASK(IMAGE_BUSINESS_OWNER_CAST) |
        IMAGE_BUSINESS_OWNER_MASK(IMAGE_BUSINESS_OWNER_CAST2PIC) |
        IMAGE_BUSINESS_OWNER_MASK(IMAGE_BUSINESS_OWNER_USB_CAST) |
        IMAGE_BUSINESS_OWNER_MASK(IMAGE_BUSINESS_OWNER_USB_CAST2PIC) |
        IMAGE_BUSINESS_OWNER_MASK(IMAGE_BUSINESS_OWNER_FACTORY_TEST);
    esp_err_t ret = ImageBusinessWorker_SubmitReplacingPending(
        IMAGE_BUSINESS_OWNER_FACTORY_RESET,
        factory_reset_worker_run,
        NULL,
        &request,
        sizeof(request),
        generation,
        replace_mask);
    if (ret != ESP_OK) {
        bool log_failure = false;
        taskENTER_CRITICAL(&s_factory_reset_request_mux);
        if (s_factory_reset_request.state == FACTORY_RESET_REQUEST_RUNNING) {
            s_factory_reset_request.state = FACTORY_RESET_REQUEST_PENDING;
            s_factory_reset_request.guard_armed = true;
        }
        if (!s_factory_reset_submit_failure_logged) {
            s_factory_reset_submit_failure_logged = true;
            log_failure = true;
        }
        taskEXIT_CRITICAL(&s_factory_reset_request_mux);
        if (log_failure) {
            ESP_LOGW(TAG,
                     "factory reset worker submit deferred source=%s seq=%u ret=%s",
                     factory_reset_trigger_to_string(trigger),
                     (unsigned int)protocol_seq,
                     esp_err_to_name(ret));
        }
        return ret;
    }

    taskENTER_CRITICAL(&s_factory_reset_request_mux);
    s_factory_reset_submit_failure_logged = false;
    taskEXIT_CRITICAL(&s_factory_reset_request_mux);

    ServerNetworkStaDailyImage_Stop();
    ServerNetworkStaSlideshow_Stop();
    LocalImageBrowsing_Stop();
    ImageBusinessWorker_Wake();
    ESP_LOGI(TAG,
             "factory reset worker submitted source=%s seq=%u generation=%lu",
             factory_reset_trigger_to_string(trigger),
             (unsigned int)protocol_seq,
             (unsigned long)generation);
    return ESP_OK;
}

static void factory_reset_task(void *arg)
{
    (void)arg;
    uint32_t held_ms = 0;
    bool waiting_release = false;

    while (true) {
        vTaskDelay(pdMS_TO_TICKS(TDX_FACTORY_RESET_CHECK_MS));

