tdxguiping/ESP32_S3_epaper/main/factory_reset/factory_reset.c
        if (factory_reset_remote_request_is_pending()) {
            held_ms = 0;
            if (ServerNetworkStaEpdDisplay_IsBusy()) {
                continue;
            }
            factory_reset_trigger_t trigger;
            uint16_t protocol_seq;
            if (factory_reset_claim_remote_request(&trigger, &protocol_seq)) {
                (void)factory_reset_submit_claimed(trigger, protocol_seq);
                continue;
            }
        }

        /* English: Do not sample GPIO28 while EPD is busy; this prevents image cleanup from racing display I/O. */
        if (ServerNetworkStaEpdDisplay_IsBusy()) {
            held_ms = 0;
            continue;
        }

        bool active = factory_reset_button_is_active();
        if (waiting_release) {
            if (!active) {
                waiting_release = false;
                held_ms = 0;
                ESP_LOGI(TAG, "factory reset button released, ready");
            }
            continue;
        }

        if (!active) {
            /* English: Any high-level sample before HOLD_MS cancels the hold and starts timing from zero next press. */
            held_ms = 0;
            continue;
        }

        held_ms += TDX_FACTORY_RESET_CHECK_MS;
        if (held_ms < TDX_FACTORY_RESET_HOLD_MS) {
            continue;
        }

        waiting_release = true;
        ESP_LOGW(TAG,
                 "factory reset button held gpio=%d hold_ms=%lu, start clear images",
                 (int)TDX_FACTORY_RESET_GPIO,
                 (unsigned long)held_ms);

        if (factory_reset_claim_gpio_request()) {
            (void)factory_reset_submit_claimed(
                FACTORY_RESET_TRIGGER_GPIO28, 0);
        }
    }
}

esp_err_t FactoryReset_Request(factory_reset_trigger_t trigger,
                               uint16_t protocol_seq)
{
#if !TDX_FACTORY_RESET_ENABLE
    (void)trigger;
    (void)protocol_seq;
    return ESP_ERR_NOT_SUPPORTED;
#else
    if (trigger != FACTORY_RESET_TRIGGER_DEVICE_INFO_KEY_PB1 &&
        trigger != FACTORY_RESET_TRIGGER_KEY_EVENT_PB1_PRESS) {
        return ESP_ERR_INVALID_ARG;
    }

    bool accepted = false;
    factory_reset_request_state_t state;
    taskENTER_CRITICAL(&s_factory_reset_request_mux);
    state = s_factory_reset_request.state;
    if (state == FACTORY_RESET_REQUEST_IDLE) {
        s_factory_reset_request.trigger = trigger;
        s_factory_reset_request.protocol_seq = protocol_seq;
        s_factory_reset_request.guard_armed = false;
        if (s_factory_reset_ready) {
            ServerNetworkStaWifiWorkTime_SetFactoryResetGuard(true);
            s_factory_reset_request.guard_armed = true;
        }
        s_factory_reset_request.state = FACTORY_RESET_REQUEST_PENDING;
        state = FACTORY_RESET_REQUEST_PENDING;
        accepted = true;
    }
    taskEXIT_CRITICAL(&s_factory_reset_request_mux);

    if (accepted) {
        Ch583FactoryTest_CancelForFactoryReset();
        ESP_LOGW(TAG,
                 "factory reset request pending source=%s seq=%u",
                 factory_reset_trigger_to_string(trigger),
                 (unsigned int)protocol_seq);
    } else {
        ESP_LOGI(TAG,
                 "factory reset request coalesced source=%s seq=%u state=%s",
                 factory_reset_trigger_to_string(trigger),
                 (unsigned int)protocol_seq,
                 factory_reset_request_state_to_string(state));
    }
    return ESP_OK;
#endif
}

esp_err_t FactoryReset_Init(const char *base_path)
{
#if !TDX_FACTORY_RESET_ENABLE
    (void)base_path;
    return ESP_OK;
#else
    if (base_path == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (s_factory_reset_task != NULL) {
        return ESP_OK;
    }

    memset(&s_factory_reset_ctx, 0, sizeof(s_factory_reset_ctx));
    strlcpy(s_factory_reset_ctx.base_path, base_path, sizeof(s_factory_reset_ctx.base_path));

    gpio_config_t io_conf = {
        .pin_bit_mask = 1ULL << TDX_FACTORY_RESET_GPIO,
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    esp_err_t ret = gpio_config(&io_conf);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "factory reset gpio config failed gpio=%d ret=%s",
                 (int)TDX_FACTORY_RESET_GPIO,
                 esp_err_to_name(ret));
        return ret;
    }

    BaseType_t task_ret = xTaskCreate(factory_reset_task,
                                      "factory_reset",
                                      FACTORY_RESET_TASK_STACK_SIZE,
                                      &s_factory_reset_ctx,
                                      FACTORY_RESET_TASK_PRIORITY,
                                      &s_factory_reset_task);
    if (task_ret != pdPASS) {
        s_factory_reset_task = NULL;
        return ESP_ERR_NO_MEM;
    }

    taskENTER_CRITICAL(&s_factory_reset_request_mux);
    s_factory_reset_ready = true;
    if (s_factory_reset_request.state == FACTORY_RESET_REQUEST_PENDING) {
        ServerNetworkStaWifiWorkTime_SetFactoryResetGuard(true);
        s_factory_reset_request.guard_armed = true;
    }
    taskEXIT_CRITICAL(&s_factory_reset_request_mux);

    ESP_LOGI(TAG,
             "factory reset gpio init pin=%d active=%d check_ms=%u hold_ms=%u",
             (int)TDX_FACTORY_RESET_GPIO,
             TDX_FACTORY_RESET_ACTIVE_LEVEL,
             (unsigned int)TDX_FACTORY_RESET_CHECK_MS,
             (unsigned int)TDX_FACTORY_RESET_HOLD_MS);
    return ESP_OK;
#endif
}
